"use strict";

/*
Необходимо попросить пользователя ввести три числа.
Необходимо создать функцию, в которую мы должны передать эти три числа.
Функция должна определить максимальное, среди переданных ей значение и 
вывести сообщение: "Максимальное значение среди чисел N1, N2, N3 равно N."

Примечание: Условимся, что пользователь всегда вводит корректные значения, 
три числа. Проверять их не нужно.
*/

function maxNumber(num1, num2, num3) {
    if (Number.isNaN(num1) || Number.isNaN(num2) || Number.isNaN(num3)) {
        return console.log("Значение задано неверно");
    }
    if (num1 > num2 && num2 >= num3) {
        console.log(
            `Максимальное значение среди чисел ${num1}, ${num2}, ${num3} равно ${num1}`
        );
    } else if (num1 > num2 && num1 > num3) {
        console.log(
            `Максимальное значение среди чисел ${num1}, ${num2}, ${num3} равно ${num1}`
        );
    } else if (num1 > num2 && num1 < num3) {
        console.log(
            `Максимальное значение среди чисел ${num1}, ${num2}, ${num3} равно ${num3}`
        );
    } else if (num1 < num2 && num2 < num3) {
        console.log(
            `Максимальное значение среди чисел ${num1}, ${num2}, ${num3} равно ${num3}`
        );
    } else {
        console.log(
            `Максимальное значение среди чисел ${num1}, ${num2}, ${num3} равно ${num2}`
        );
    }
}

const num1 = +prompt("Введите 1е число");
const num2 = +prompt("Введите 2е число");
const num3 = +prompt("Введите 3е число");

maxNumber(num1, num2, num3);